FradSer/open-deskos/peripherals/esp32-p4-camera/sdkconfig.defaults
# ESP32-P4 target
CONFIG_IDF_TARGET="esp32p4"

# Chip Revision (ESP32-P4 v1.3 compatibility)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP32P4_REV_MIN_FULL=100
CONFIG_ESP_REV_MIN_FULL=100

# Flash and PSRAM configuration
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Camera Interface - MIPI CSI-2 with SC2336
CONFIG_CAMERA_SC2336=y
CONFIG_CAMERA_SC2336_AUTO_DETECT=y
CONFIG_CAMERA_SC2336_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_SC2336_MIPI_RAW8_1280x720_30FPS=y

# Hardware JPEG encoder for the UVC MJPEG stream
CONFIG_ESP_VIDEO_ENABLE_HW_JPEG_VIDEO_DEVICE=y

# Default UVC Frame Configuration
CONFIG_APP_CAMERA_FRAME_WIDTH=1280
CONFIG_APP_CAMERA_FRAME_HEIGHT=720
CONFIG_APP_UVC_JPEG_QUALITY=80

# SCCB I2C Pin Configuration for SC2336 on P4
CONFIG_APP_CAMERA_SCCB_I2C_PORT=0
CONFIG_APP_CAMERA_SCCB_I2C_FREQ=100000
CONFIG_APP_CAMERA_MIPI_SCCB_SCL_PIN=8
CONFIG_APP_CAMERA_MIPI_SCCB_SDA_PIN=7
CONFIG_APP_CAMERA_SC2336_MIPI_RESET_PIN=26
CONFIG_APP_CAMERA_SC2336_MIPI_PWDN_PIN=-1

# USB Device Configuration (UVC camera + UAC microphone composite)
CONFIG_TINYUSB=y
CONFIG_USB_DEVICE_UAC_AS_PART=y
CONFIG_UAC_SPEAKER_CHANNEL_NUM=0
CONFIG_UAC_MIC_CHANNEL_NUM=1
CONFIG_UAC_SAMPLE_RATE=16000
CONFIG_UAC_BIT_RESOLUTION_16=y
CONFIG_CODEC_ES8311_SUPPORT=y
CONFIG_APP_USB_MICROPHONE=y

# OSPTEK ESP32-P4C6 module baseboard V1.3 audio wiring.
CONFIG_APP_AUDIO_I2S_PORT=0
CONFIG_APP_AUDIO_I2S_MCLK_PIN=13
CONFIG_APP_AUDIO_I2S_BCLK_PIN=12
CONFIG_APP_AUDIO_I2S_WS_PIN=10
CONFIG_APP_AUDIO_I2S_DIN_PIN=11
CONFIG_APP_AUDIO_INPUT_GAIN_DB=30

# Log Level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
